import numpy as np
import pandas as pd
import plotly.offline
import plotly.express as px
import plotly.graph_objects as go
from plotly.subplots import make_subplots
from datetime import datetime


#데이터 불러오기
df = pd.read_csv("~/import_data//ETB_BDT_KCBD_0007.csv", sep="|")
df.columns = ["기준년월","시군구코드","연령구간코드","인구수","남자인구수","여자인구수","급여소득자인구수","자영업자인구수","기타소득자인구수","외국인수","평균출퇴근거리","하이엔드인구수","월소득평균금액","2백만원이하월소득평균금액","2백초과3백만원이하월소득평균금액","3백초과4백만원이하월소득평균금액","4백초과5백만원이하월소득평균금액","5백초과6백만원이하월소득평균금액","6백초과7백만원이하월소득평균금액","7백초과8백만원이하월소득평균금액","8백초과9백만원이하월소득평균금액","9백초과1천만원이하월소득평균금액","1천만원초과월소득평균금액","중위월소득금액","주택보유자수","총보유주택평균평가금액","승용차보유자수","수입차보유자수","승용차신차보유자수","보유승용차평균가격","보유상용차평균가격","카드보유자수","신용카드보유자수","신용카드보유평균개수","체크카드보유자수","체크카드보유평균개수","카드이용평균금액","신용판매이용평균금액","현금서비스평균이용금액","카드일시불평균이용금액","카드할부평균이용금액","신용카드평균이용금액","체크카드평균이용금액","해외신용판매평균이용금액","해외현금서비스평균이용금액","단기이상연체자수","장기이상연체자수","대출보유자수","은행업권대출보유자수","은행업권외대출보유자수","신용대출보유자수","주택담보대출보유자수","예적금담보대출보유자수","정책자금대출보유자수","대출평균잔액","은행업권평균대출잔액","은행업권외평균대출잔액","신용대출평균잔액","주택담보대출평균잔액","카드론보유자수","카드론평균잔액","한도대출보유자수","한도대출평균잔액","당월신규대출자수","당월신규은행업권대출자수","당월신규은행업권외대출자수","당월신규신용대출자수","당월신규주택담보대출자수","평균신용평가점수","월소득평균2백만원이하대상자수","월소득평균2백초과3백만원이하대상자수","월소득평균3백초과4백만원이하대상자수","월소득평균4백초과5백만원이하대상자수","월소득평균5백초과6백만원이하대상자수","월소득평균6백초과7백만원이하대상자수","월소득평균7백초과8백만원이하대상자수","월소득평균8백초과9백만원이하대상자수","월소득평균9백초과1천만원이하대상자수","월소득평균1천만원초과대상자수"]
df_1=df.loc[:,['기준년월','평균신용평가점수','시군구코드','인구수','대출평균잔액']]

# 지역 해시
monthint = {
    #12,32
    '11':'서울특별시',
    '26':'부산광역시',
    '27':'대구광역시',
    '28':'인천광역시',
    '29':'광주광역시',
    '30':'대전광역시',
    '31':'울산광역시',
    '36':'세종특별자치시',
    '41':'경기도',
    '42':'강원도',
    '43':'충청북도',
    '44':'충청남도',
    '45':'전라북도',
    '46':'전라남도',
    '47':'경상북도',
    '48':'경상남도',
    '50':'제주특별자치도',
}

#기준년월 필드 date타입으로 변환
df_1['기준년월']=df_1['기준년월'].astype('str')
df_1['기준년월']=df_1['기준년월'].apply(lambda _ :datetime.strptime(_, '%Y%m'))
df_1['기준년월']=df_1['기준년월'].dt.to_period(freq='M')
df_1['기준년월']=df_1['기준년월'].astype('str')

#전처리
df_1['시군구코드']=round(df_1['시군구코드']//1000,0)
df_1['시군구코드']=df_1['시군구코드'].astype('str')
df_1['시군구코드']=df_1['시군구코드'].map(monthint)
df_1
df_1=df_1.groupby(by=['기준년월','시군구코드']).mean().reset_index()



#그래프 만들기
fig=px.scatter(df_1,x='대출평균잔액', y='평균신용평가점수', size='인구수', color='시군구코드', hover_name='시군구코드', log_x=True, size_max=45)
              
#그래프 레이아웃 설정
fig.update_layout(showlegend=True, title='<b>인구수에 따른 버블크기와 시군구에 다른 버블색상 비교<b>',
                  xaxis={'title':{'text':'대출평균잔액'}},
                  yaxis={'title':{'text':'평균신용평가점수'}})
plotly.offline.plot(fig,filename='4.인구수에 따른 버블크기와 시군구에 다른 버블색상.html')
