#<Boxplot 이상치 탐지>
#카드이용평균금액 boxplot
import numpy as np
import pandas as pd
import plotly as plotly
import plotly.express as px
import plotly.graph_objects as go
from plotly.subplots import make_subplots
from datetime import datetime
import seaborn as sns
df = pd.read_csv("./import_data/etb_bdt_kcbd_0007.csv", sep="|")
df.columns = ["기준년월","시군구코드", "연령구간코드", "인구수", "남자인구수",
            "여자인구수","급여소득자인구수", "자영업자인구수", "기타소득자인구수", "외국인수",
            "평균출퇴근거리","하이엔드인구수", "월소득평균금액", "2백만원이하월소득평균금액", "2백초과3백만원이하월소득평균금액",
            "3백초과4백만원이하월소득평균금액","4백초과5백만원이하월소득평균금액", "5백초과6백만원이하월소득평균금액", "6백초과7백만원이하월소득평균금액", "7백초과8백만원이하월소득평균금액",
            "8백초과9백만원이하월소득평균금액","9백초과1천만원이하월소득평균금액", "1천만원초과월소득평균금액", "중위월소득금액", "주택보유자수",
            "총보유주택평균평가금액","승용차보유자수", "수입차보유자수", "승용차신차보유자수", "보유승용차평균가격",
            "보유상용차평균가격","카드보유자수", "신용카드보유자수", "신용카드보유평균개수", "체크카드보유자수",
            "체크카드보유평균개수	","카드이용평균금액", "신용판매이용평균금액", "현금서비스평균이용금액", "카드일시불평균이용금액",
            "카드할부평균이용금액","신용카드평균이용금액", "체크카드평균이용금액", "해외신용판매평균이용금액", "해외현금서비스평균이용금액",
            "단기이상연체자수","장기이상연체자수", "대출보유자수", "은행업권대출보유자수", "은행업권외대출보유자수",
            "신용대출보유자수","주택담보대출보유자수", "예적금담보대출보유자수", "정책자금대출보유자수", "대출평균잔액",
            "은행업권평균대출잔액","은행업권외평균대출잔액", "신용대출평균잔액", "주택담보대출평균잔액", "카드론보유자수",
            "카드론평균잔액","한도대출보유자수", "한도대출평균잔액", "당월신규대출자수", "당월신규은행업권대출자수",
            "당월신규은행업권외대출자수","당월신규신용대출자수", "당월신규주택담보대출자수", "평균신용평가점수", "월소득평균2백만원이하대상자수",
            "월소득평균2백초과3백만원이하대상자수","월소득평균3백초과4백만원이하대상자수", "월소득평균4백초과5백만원이하대상자수", "월소득평균5백초과6백만원이하대상자수", "월소득평균6백초과7백만원이하대상자수",
            "월소득평균7백초과8백만원이하대상자수","월소득평균8백초과9백만원이하대상자수", "월소득평균9백초과1천만원이하대상자수", "월소득평균1천만원초과대상자수"]

df_1=df.loc[:,['기준년월','월소득평균금액','보유승용차평균가격','평균신용평가점수','대출평균잔액','카드이용평균금액']]

#그래프생성
fig=px.box(df_1,y=df_1['카드이용평균금액'])
fig.update_layout(title='<b>카드이용평균금액 Boxplot<b>')
plotly.offline.plot(fig,filename='카드이용평균금액 Boxplot.html')
